evaluation_tests/test2_webserver/tc2_js_curve_c16/step13_rps32__assets_index_u5eV4oN_js.txt
Running 30s test @ http://54.235.233.71/assets/index-u5eV4oN_.js
  4 threads and 16 connections
  Thread calibration: mean lat.: 1401.902ms, rate sampling interval: 4489ms
  Thread calibration: mean lat.: 1892.612ms, rate sampling interval: 9265ms
  Thread calibration: mean lat.: 1237.804ms, rate sampling interval: 4149ms
  Thread calibration: mean lat.: 1014.540ms, rate sampling interval: 5185ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.59s     2.95s   13.94s    72.17%
    Req/Sec     5.85      0.53     7.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.75s 
 75.000%    4.73s 
 90.000%    7.89s 
 99.000%   13.80s 
 99.900%   13.95s 
 99.990%   13.95s 
 99.999%   13.95s 
100.000%   13.95s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     245.887     0.000000            1         1.00
     501.759     0.100000           51         1.11
    1044.479     0.200000          101         1.25
    1851.391     0.300000          151         1.43
    2433.023     0.400000          202         1.67
    2746.367     0.500000          253         2.00
    3008.511     0.550000          277         2.22
    3416.063     0.600000          302         2.50
    3774.463     0.650000          327         2.86
    4259.839     0.700000          353         3.33
    4739.071     0.750000          378         4.00
    5128.191     0.775000          390         4.44
    5476.351     0.800000          403         5.00
    6123.519     0.825000          415         5.71
    6541.311     0.850000          428         6.67
    7389.183     0.875000          441         8.00
    7688.191     0.887500          447         8.89
    7888.895     0.900000          453        10.00
    8044.543     0.912500          459        11.43
    8298.495     0.925000          466        13.33
    8470.527     0.937500          472        16.00
    8527.871     0.943750          475        17.78
    8863.743     0.950000          478        20.00
    9363.455     0.956250          481        22.86
   10600.447     0.962500          485        26.67
   11673.599     0.968750          488        32.00
   12181.503     0.971875          489        35.56
   12828.671     0.975000          491        40.00
   12984.319     0.978125          492        45.71
   13262.847     0.981250          494        53.33
   13606.911     0.984375          496        64.00
   13606.911     0.985938          496        71.11
   13778.943     0.987500          497        80.00
   13795.327     0.989062          498        91.43
   13811.711     0.990625          499       106.67
   13877.247     0.992188          500       128.00
   13877.247     0.992969          500       142.22
   13877.247     0.993750          500       160.00
   13926.399     0.994531          501       182.86
   13926.399     0.995313          501       213.33
   13950.975     0.996094          503       256.00
   13950.975     1.000000          503          inf
#[Mean    =     3587.166, StdDeviation   =     2949.500]
#[Max     =    13942.784, Total count    =          503]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  754 requests in 30.02s, 154.59MB read
Requests/sec:     25.12
Transfer/sec:      5.15MB