evaluation_tests/test2_webserver/tc2_js_curve_c16/step14_rps34__assets_index_u5eV4oN_js.txt
Running 30s test @ http://54.235.233.71/assets/index-u5eV4oN_.js
  4 threads and 16 connections
  Thread calibration: mean lat.: 3906.453ms, rate sampling interval: 12320ms
  Thread calibration: mean lat.: 3420.353ms, rate sampling interval: 11460ms
  Thread calibration: mean lat.: 3212.453ms, rate sampling interval: 9805ms
  Thread calibration: mean lat.: 3680.841ms, rate sampling interval: 12173ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.43s     3.73s   21.14s    62.19%
    Req/Sec     3.20      0.75     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.26s 
 75.000%   15.13s 
 90.000%   17.61s 
 99.000%   20.37s 
 99.900%   21.15s 
 99.990%   21.15s 
 99.999%   21.15s 
100.000%   21.15s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5308.415     0.000000            1         1.00
    7516.159     0.100000           29         1.11
    8667.135     0.200000           57         1.25
   10100.735     0.300000           85         1.43
   11304.959     0.400000          114         1.67
   12255.231     0.500000          143         2.00
   12681.215     0.550000          156         2.22
   13443.071     0.600000          170         2.50
   13934.591     0.650000          184         2.86
   14532.607     0.700000          199         3.33
   15228.927     0.750000          213         4.00
   15425.535     0.775000          220         4.44
   15810.559     0.800000          227         5.00
   16064.511     0.825000          234         5.71
   16515.071     0.850000          241         6.67
   17055.743     0.875000          248         8.00
   17563.647     0.887500          252         8.89
   17612.799     0.900000          255        10.00
   18071.551     0.912500          259        11.43
   18366.463     0.925000          262        13.33
   18612.223     0.937500          266        16.00
   18972.671     0.943750          268        17.78
   19070.975     0.950000          269        20.00
   19316.735     0.956250          271        22.86
   19644.415     0.962500          273        26.67
   19922.943     0.968750          275        32.00
   19955.711     0.971875          276        35.56
   19955.711     0.975000          276        40.00
   19988.479     0.978125          277        45.71
   20021.247     0.981250          278        53.33
   20348.927     0.984375          279        64.00
   20365.311     0.985938          280        71.11
   20365.311     0.987500          280        80.00
   20365.311     0.989062          280        91.43
   20496.383     0.990625          281       106.67
   20496.383     0.992188          281       128.00
   20807.679     0.992969          282       142.22
   20807.679     0.993750          282       160.00
   20807.679     0.994531          282       182.86
   20807.679     0.995313          282       213.33
   20807.679     0.996094          282       256.00
   21151.743     0.996484          283       284.44
   21151.743     1.000000          283          inf
#[Mean    =    12426.584, StdDeviation   =     3733.575]
#[Max     =    21135.360, Total count    =          283]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  399 requests in 30.02s, 82.60MB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:     13.29
Transfer/sec:      2.75MB